---
kind: method
id: M:Autodesk.Revit.DB.ScheduleDefinition.Dispose
source: html/3e5144b2-76a1-75fb-31a5-5902dc23b172.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.Dispose Method

Releases all resources used by the ScheduleDefinition

## Syntax (C#)
```csharp
public void Dispose()
```